_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_124 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_124 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_125 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_125 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_62 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_186 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_187 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_188 (Dense)            (None, 2)                 170       
=================================================================
Total params: 80,622
Trainable params: 80,622
Non-trainable params: 0
_________________________________________________________________
