_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_36 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_17 (Dense)             (None, 10)                1290      
=================================================================
Total params: 46,442
Trainable params: 46,442
Non-trainable params: 0
_________________________________________________________________
