_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_14 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_15 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 576)               0         
_________________________________________________________________
dense_21 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_22 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_23 (Dense)             (None, 10)                850       
=================================================================
Total params: 81,194
Trainable params: 81,194
Non-trainable params: 0
_________________________________________________________________
