_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_120 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_119 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_121 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_120 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_122 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_121 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_123 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_122 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_29 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_58 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_59 (Dense)             (None, 2)                 258       
=================================================================
Total params: 45,410
Trainable params: 45,410
Non-trainable params: 0
_________________________________________________________________
