_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_148 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_147 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_149 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_148 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_150 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_149 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_151 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_150 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_36 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_72 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_73 (Dense)             (None, 3)                 387       
=================================================================
Total params: 45,539
Trainable params: 45,539
Non-trainable params: 0
_________________________________________________________________
