_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_22 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_23 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_33 (Dense)             (None, 120)               376440    
_________________________________________________________________
dense_34 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_35 (Dense)             (None, 2)                 170       
=================================================================
Total params: 387,822
Trainable params: 387,822
Non-trainable params: 0
_________________________________________________________________
