_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_76 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_76 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_77 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_114 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_115 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_116 (Dense)            (None, 3)                 255       
=================================================================
Total params: 80,599
Trainable params: 80,599
Non-trainable params: 0
_________________________________________________________________
