_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_132 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_131 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_133 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_132 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_134 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_133 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_135 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_134 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_64 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_65 (Dense)             (None, 4)                 516       
=================================================================
Total params: 45,668
Trainable params: 45,668
Non-trainable params: 0
_________________________________________________________________
