_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_30 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_31 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_45 (Dense)             (None, 120)               376440    
_________________________________________________________________
dense_46 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_47 (Dense)             (None, 2)                 170       
=================================================================
Total params: 387,822
Trainable params: 387,822
Non-trainable params: 0
_________________________________________________________________
