_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_168 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_168 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_169 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_169 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_84 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_252 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_253 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_254 (Dense)            (None, 4)                 340       
=================================================================
Total params: 80,792
Trainable params: 80,792
Non-trainable params: 0
_________________________________________________________________
