_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_80 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_80 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_81 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_120 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_121 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_122 (Dense)            (None, 4)                 340       
=================================================================
Total params: 387,992
Trainable params: 387,992
Non-trainable params: 0
_________________________________________________________________
