_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_22 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_23 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_34 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_35 (Dense)             (None, 2)                 170       
=================================================================
Total params: 80,514
Trainable params: 80,514
Non-trainable params: 0
_________________________________________________________________
