_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_112 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_112 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_113 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_113 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_56 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_168 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_169 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_170 (Dense)            (None, 10)                850       
=================================================================
Total params: 81,302
Trainable params: 81,302
Non-trainable params: 0
_________________________________________________________________
