_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_74 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_74 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_75 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_111 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_112 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_113 (Dense)            (None, 3)                 255       
=================================================================
Total params: 387,907
Trainable params: 387,907
Non-trainable params: 0
_________________________________________________________________
