_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_200 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_199 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_201 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_200 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_202 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_201 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_203 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_202 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_49 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_98 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_99 (Dense)             (None, 9)                 1161      
=================================================================
Total params: 46,313
Trainable params: 46,313
Non-trainable params: 0
_________________________________________________________________
