_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_88 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_88 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_89 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_89 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_44 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_132 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_133 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_134 (Dense)            (None, 4)                 340       
=================================================================
Total params: 387,992
Trainable params: 387,992
Non-trainable params: 0
_________________________________________________________________
