_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_14 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_15 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_21 (Dense)             (None, 120)               376440    
_________________________________________________________________
dense_22 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_23 (Dense)             (None, 10)                850       
=================================================================
Total params: 388,502
Trainable params: 388,502
Non-trainable params: 0
_________________________________________________________________
