{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "kernel_size": [3, 3], "filters": 6, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_58", "use_bias": true, "data_format": "channels_last", "batch_input_shape": [null, 64, 64, 3], "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "padding": "valid", "pool_size": [2, 2], "name": "average_pooling2d_58", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"dtype": "float32", "kernel_size": [3, 3], "filters": 16, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_59", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "padding": "valid", "pool_size": [2, 2], "name": "average_pooling2d_59", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_29", "trainable": true}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 120, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_87", "use_bias": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 84, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_88", "use_bias": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 2, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_89", "use_bias": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_29"}, "keras_version": "2.2.4-tf", "class_name": "Sequential"}