_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_40 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_19 (Dense)             (None, 10)                1290      
=================================================================
Total params: 46,442
Trainable params: 46,442
Non-trainable params: 0
_________________________________________________________________
