_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_96 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_95 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_97 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_96 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_98 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_97 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_99 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_98 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_23 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_47 (Dense)             (None, 2)                 258       
=================================================================
Total params: 45,410
Trainable params: 45,410
Non-trainable params: 0
_________________________________________________________________
