_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_90 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_90 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_91 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_91 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_135 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_136 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_137 (Dense)            (None, 9)                 765       
=================================================================
Total params: 81,109
Trainable params: 81,109
Non-trainable params: 0
_________________________________________________________________
