_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_74 (Conv2D)           (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_74 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_75 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_111 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_112 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_113 (Dense)            (None, 3)                 255       
=================================================================
Total params: 80,707
Trainable params: 80,707
Non-trainable params: 0
_________________________________________________________________
