_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_152 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_151 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_153 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_152 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_154 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_153 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_155 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_154 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_74 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_75 (Dense)             (None, 3)                 387       
=================================================================
Total params: 45,539
Trainable params: 45,539
Non-trainable params: 0
_________________________________________________________________
