{"config": {"name": "sequential_33", "layers": [{"config": {"padding": "valid", "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_66", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 6, "batch_input_shape": [null, 32, 32, 1], "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "name": "average_pooling2d_66", "trainable": true, "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_67", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "name": "average_pooling2d_67", "trainable": true, "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_33", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "dtype": "float32", "units": 120, "name": "dense_99", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "dtype": "float32", "units": 84, "name": "dense_100", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "dtype": "float32", "units": 4, "name": "dense_101", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow"}