_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_154 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_154 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_155 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_155 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_77 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_231 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_232 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_233 (Dense)            (None, 2)                 170       
=================================================================
Total params: 80,622
Trainable params: 80,622
Non-trainable params: 0
_________________________________________________________________
