_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_156 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_155 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_157 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_156 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_158 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_157 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_159 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_158 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_76 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_77 (Dense)             (None, 3)                 387       
=================================================================
Total params: 45,539
Trainable params: 45,539
Non-trainable params: 0
_________________________________________________________________
