{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_15", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_30", "batch_input_shape": [null, 64, 64, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 6, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid"}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_30", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_31", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 16, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid"}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_31", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_15", "trainable": true, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_45", "bias_regularizer": null, "units": 120, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_46", "bias_regularizer": null, "units": 84, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_47", "bias_regularizer": null, "units": 2, "activity_regularizer": null, "dtype": "float32", "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}}]}}