_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_76 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_76 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_77 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_114 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_115 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_116 (Dense)            (None, 3)                 255       
=================================================================
Total params: 387,907
Trainable params: 387,907
Non-trainable params: 0
_________________________________________________________________
