_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_78 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_78 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_79 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_39 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_117 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_118 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_119 (Dense)            (None, 3)                 255       
=================================================================
Total params: 387,907
Trainable params: 387,907
Non-trainable params: 0
_________________________________________________________________
