_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_98 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_98 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_99 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_99 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_49 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_147 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_148 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_149 (Dense)            (None, 9)                 765       
=================================================================
Total params: 388,417
Trainable params: 388,417
Non-trainable params: 0
_________________________________________________________________
