_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_128 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_127 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_129 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_128 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_130 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_129 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_131 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_130 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_31 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_62 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_63 (Dense)             (None, 4)                 516       
=================================================================
Total params: 45,668
Trainable params: 45,668
Non-trainable params: 0
_________________________________________________________________
