_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_192 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_191 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_193 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_192 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_194 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_193 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_195 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_194 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_47 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_94 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_95 (Dense)             (None, 9)                 1161      
=================================================================
Total params: 46,313
Trainable params: 46,313
Non-trainable params: 0
_________________________________________________________________
