_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_42 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_42 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_43 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_64 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_65 (Dense)             (None, 2)                 170       
=================================================================
Total params: 80,514
Trainable params: 80,514
Non-trainable params: 0
_________________________________________________________________
