_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_64 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_64 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_65 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_96 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_97 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_98 (Dense)             (None, 4)                 340       
=================================================================
Total params: 80,684
Trainable params: 80,684
Non-trainable params: 0
_________________________________________________________________
