_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_184 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_183 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_185 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_184 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_186 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_185 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_187 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_186 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_90 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_91 (Dense)             (None, 9)                 1161      
=================================================================
Total params: 46,313
Trainable params: 46,313
Non-trainable params: 0
_________________________________________________________________
