_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_180 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_179 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_181 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_180 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_182 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_181 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_183 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_182 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_44 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_88 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_89 (Dense)             (None, 4)                 516       
=================================================================
Total params: 45,668
Trainable params: 45,668
Non-trainable params: 0
_________________________________________________________________
