_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_94 (Conv2D)           (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_94 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_95 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_47 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_141 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_142 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_143 (Dense)            (None, 9)                 765       
=================================================================
Total params: 81,217
Trainable params: 81,217
Non-trainable params: 0
_________________________________________________________________
