_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_30 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_31 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_45 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_46 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_47 (Dense)             (None, 2)                 170       
=================================================================
Total params: 80,622
Trainable params: 80,622
Non-trainable params: 0
_________________________________________________________________
