{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "name": "conv2d_12", "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 64, 64, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "filters": 32, "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "name": "conv2d_13", "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "filters": 32, "trainable": true, "bias_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_13", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "name": "conv2d_14", "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "filters": 32, "trainable": true, "bias_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_14", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "name": "conv2d_15", "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "filters": 32, "trainable": true, "bias_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_15", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_3"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_6", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_7", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 4, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "softmax"}}], "name": "sequential_3"}}