{"keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 6, "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "batch_input_shape": [null, 32, 32, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_122", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "dtype": "float32", "strides": [2, 2], "data_format": "channels_last", "name": "average_pooling2d_122", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_123", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "dtype": "float32", "strides": [2, 2], "data_format": "channels_last", "name": "average_pooling2d_123", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten_61"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "units": 120, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_183", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "units": 84, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_184", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "units": 2, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "name": "dense_185", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}], "name": "sequential_61"}, "backend": "tensorflow"}