_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_48 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_47 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_49 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_50 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_23 (Dense)             (None, 2)                 258       
=================================================================
Total params: 45,410
Trainable params: 45,410
Non-trainable params: 0
_________________________________________________________________
