{"backend": "tensorflow", "config": {"layers": [{"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_88", "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "batch_input_shape": [null, 64, 64, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_87", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_89", "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_88", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_90", "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_89", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_91", "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_90", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "flatten_21"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "name": "dense_42", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "dense_43", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 2, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_22"}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}