_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_86 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_86 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_87 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_87 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_129 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_130 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_131 (Dense)            (None, 4)                 340       
=================================================================
Total params: 80,684
Trainable params: 80,684
Non-trainable params: 0
_________________________________________________________________
