_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_118 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_118 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_119 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_59 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_177 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_178 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_179 (Dense)            (None, 10)                850       
=================================================================
Total params: 81,302
Trainable params: 81,302
Non-trainable params: 0
_________________________________________________________________
