_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_178 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_178 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_179 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_179 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_89 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_267 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_268 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_269 (Dense)            (None, 3)                 255       
=================================================================
Total params: 80,707
Trainable params: 80,707
Non-trainable params: 0
_________________________________________________________________
