_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_116 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_115 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_117 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_116 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_118 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_117 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_28 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_56 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_57 (Dense)             (None, 2)                 258       
=================================================================
Total params: 45,410
Trainable params: 45,410
Non-trainable params: 0
_________________________________________________________________
