_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_60 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_59 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_60 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_61 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_62 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_28 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_29 (Dense)             (None, 2)                 258       
=================================================================
Total params: 45,410
Trainable params: 45,410
Non-trainable params: 0
_________________________________________________________________
