_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_192 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_192 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_193 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_193 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_96 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_288 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_289 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_290 (Dense)            (None, 9)                 765       
=================================================================
Total params: 81,217
Trainable params: 81,217
Non-trainable params: 0
_________________________________________________________________
