_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_84 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_84 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_85 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_85 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_126 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_127 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_128 (Dense)            (None, 4)                 340       
=================================================================
Total params: 80,684
Trainable params: 80,684
Non-trainable params: 0
_________________________________________________________________
