_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_140 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_139 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_141 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_140 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_142 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_141 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_143 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_142 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_34 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_68 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_69 (Dense)             (None, 4)                 516       
=================================================================
Total params: 45,668
Trainable params: 45,668
Non-trainable params: 0
_________________________________________________________________
