_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_10 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_11 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 576)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_16 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_17 (Dense)             (None, 10)                850       
=================================================================
Total params: 81,302
Trainable params: 81,302
Non-trainable params: 0
_________________________________________________________________
