_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_168 (Conv2D)          (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_167 (MaxPoolin (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_169 (Conv2D)          (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_168 (MaxPoolin (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_170 (Conv2D)          (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_169 (MaxPoolin (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_171 (Conv2D)          (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_170 (MaxPoolin (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_41 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_82 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_83 (Dense)             (None, 4)                 516       
=================================================================
Total params: 45,668
Trainable params: 45,668
Non-trainable params: 0
_________________________________________________________________
