_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_56 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_55 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_56 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_57 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_58 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_27 (Dense)             (None, 2)                 258       
=================================================================
Total params: 45,410
Trainable params: 45,410
Non-trainable params: 0
_________________________________________________________________
