_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_94 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_94 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_95 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_47 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_141 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_142 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_143 (Dense)            (None, 9)                 765       
=================================================================
Total params: 388,417
Trainable params: 388,417
Non-trainable params: 0
_________________________________________________________________
