_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_188 (Conv2D)          (None, 30, 30, 6)         168       
_________________________________________________________________
average_pooling2d_188 (Avera (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_189 (Conv2D)          (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_189 (Avera (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_94 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_282 (Dense)            (None, 120)               69240     
_________________________________________________________________
dense_283 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_284 (Dense)            (None, 4)                 340       
=================================================================
Total params: 80,792
Trainable params: 80,792
Non-trainable params: 0
_________________________________________________________________
