{"config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 6, "kernel_regularizer": null, "name": "conv2d_72", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "batch_input_shape": [null, 64, 64, 3], "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "average_pooling2d_72", "trainable": true, "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 16, "kernel_regularizer": null, "name": "conv2d_73", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "average_pooling2d_73", "trainable": true, "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_36", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_108", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "units": 120, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_109", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "units": 84, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_110", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "softmax", "units": 3, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null}}], "name": "sequential_36"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}