_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_2 (Average (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_3 (Average (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 120)               376440    
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 340       
=================================================================
Total params: 387,992
Trainable params: 387,992
Non-trainable params: 0
_________________________________________________________________
