_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_82 (Conv2D)           (None, 62, 62, 6)         168       
_________________________________________________________________
average_pooling2d_82 (Averag (None, 31, 31, 6)         0         
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 29, 29, 16)        880       
_________________________________________________________________
average_pooling2d_83 (Averag (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_41 (Flatten)         (None, 3136)              0         
_________________________________________________________________
dense_123 (Dense)            (None, 120)               376440    
_________________________________________________________________
dense_124 (Dense)            (None, 84)                10164     
_________________________________________________________________
dense_125 (Dense)            (None, 4)                 340       
=================================================================
Total params: 387,992
Trainable params: 387,992
Non-trainable params: 0
_________________________________________________________________
